Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
#pragma once
/// \file      halGPIO_ex.h
/// \author    Rafael Serrano (rsr.openware@gmail.com)
/// \brief     GPIO module manager.
/// \addtogroup HTL HAL Template Library
/// @{
/// \addtogroup HTL_STM32 STM32
/// @{
/// \defgroup HTL_STM32_GPIO GPIO
/// @{
#ifndef __STM32_htlGPIO__
#define __STM32_htlGPIO__


// EOS includes
//
#include "eos.h"


namespace htl {

    /// \brief GPIO port identifiers.
    enum class GPIOPort {
        #ifdef GPIOA_BASE
            portA,
        #endif
        #ifdef GPIOB_BASE
            portB,
        #endif
        #ifdef GPIOC_BASE
            portC,
        #endif
        #ifdef GPIOD_BASE
            portD,
        #endif
        #ifdef GPIOE_BASE
            portE,
        #endif
        #ifdef GPIOF_BASE
            portF,
        #endif
        #ifdef GPIOG_BASE
            portG,
        #endif
        #ifdef GPIOH_BASE
            portH,
        #endif
        #ifdef GPIOI_BASE
            portI,
        #endif
        #ifdef GPIOJ_BASE
            portJ,
        #endif
        #ifdef GPIOK_BASE
            portK,
        #endif
    };

    /// \brief GPIO Pin identifiers.
    enum class GPIOPin {
        pin0,
        pin1,
        pin2,
        pin3,
        pin4,
        pin5,
        pin6,
        pin7,
        pin8,
        pin9,
        pin10,
        pin11,
        pin12,
        pin13,
        pin14,
        pin15
    };

    /// \brief GPIO Pull up/down mode identifier.
    enum class GPIOPull {
        none = 0,
        up   = 1,
        down = 2
    };

    /// \brief GPIO Driver type identifiers.
    enum class GPIODriver {
        pushPull  = 0,
        openDrain = 1
    };

    /// \brief GPIO Speed identifier.
    enum class GPIOSpeed {
        low    = 0,
        medium = 1,
        high   = 2,
        fast   = 3
    };

    /*typedef uint32_t GPIOOptions;
    constexpr const uint32_t GPIOPull_pos = 0;
    constexpr const uint32_t GPIOPull_bits = 0b11;
    constexpr const uint32_t GPIOPull_mask = GPIOPull_bits << GPIOPull_pos;
    constexpr const uint32_t GPIODriver_pos = 2;
    constexpr const uint32_t GPIODriver_bits = 0b1;
    constexpr const uint32_t GPIODriver_mask = GPIODriver_bits << GPIODriver_pos;
    constexpr const uint32_t GPIOSpeed_pos = 3;
    constexpr const uint32_t GPIOSpeed_bits = 0b11;
    constexpr const uint32_t GPIOSpeed_mask = GPIOSpeed_bits << GPIOSpeed_pos;
    constexpr const uint32_t GPIOAlt_pos = 5;
    constexpr const uint32_t GPIOAlt_bits = 0b1111;
    constexpr const uint32_t GPIOAlt_mask = GPIOAlt_bits << GPIOAlt_pos;*/

    void GPIO_initInput(GPIO_TypeDef*, uint32_t, GPIOPull);
    void GPIO_initOutput(GPIO_TypeDef*, uint32_t, GPIODriver, GPIOSpeed);
    void GPIO_initAlt(GPIO_TypeDef*, uint32_t, GPIODriver, GPIOSpeed, unsigned);
    void GPIO_deInit(GPIO_TypeDef*, uint32_t);

    template <GPIOPort port_, GPIOPin pin_>
    struct GPIOInfo {
        enum class GPIOAlt {
        };
        static const uint32_t addr;
        static const uint32_t pn;
    };

    /// \class GPIO_x
    /// \brief Adapter class for gpio pins
    ///
    template <GPIOPort port_, GPIOPin pin_>
    class GPIO_x {
        public:
            using GPIOAlt = typename GPIOInfo<port_, pin_>::GPIOAlt;

        private:
            using Info = GPIOInfo<port_, pin_>;
            constexpr static const uint32_t _addr = Info::addr;
            constexpr static const uint32_t _pn = Info::pn;

        public:
            constexpr static const GPIOPort port = port_;
            constexpr static const GPIOPin pin = pin_;

        private:
            GPIO_x() = delete;
            GPIO_x(const GPIO_x &) = delete;
            GPIO_x(const GPIO_x &&) = delete;
            ~GPIO_x() = delete;

            GPIO_x & operator = (const GPIO_x &) = delete;
            GPIO_x & operator = (const GPIO_x &&) = delete;

        public:
            static void initInput(GPIOPull pull = GPIOPull::none) {

            	/*GPIOOptions options =
            		uint32_t(pull) << GPIOPull_pos;*/

                GPIO_initInput(
                    reinterpret_cast<GPIO_TypeDef*>(_addr), 
                    _pn,
                    pull);
            }

            static void initOutput(GPIODriver driver, GPIOSpeed speed = GPIOSpeed::medium) {

            	/*GPIOOptions options =
            		(uint32_t(driver) << GPIODriver_pos) |
					(uint32_t(speed) << GPIOSpeed_pos);*/

            	GPIO_initOutput(
                    reinterpret_cast<GPIO_TypeDef*>(_addr),
                    _pn,
                    driver,
                    speed);
            }

            static void initAlt(GPIODriver driver, GPIOSpeed speed, GPIOAlt alt) {
                
            	/*GPIOOptions options =
            		(uint32_t(driver) << GPIODriver_pos) |
					(uint32_t(speed) << GPIOSpeed_pos) |
					(uint32_t(alt) << GPIOAlt_pos);*/

            	GPIO_initAlt(
                    reinterpret_cast<GPIO_TypeDef*>(_addr),
                    _pn,
                    driver,
                    speed,
                    unsigned(alt));
            }

            inline static void deInit() {

            	GPIO_deInit(
            		reinterpret_cast<GPIO_TypeDef*>(_addr),
					_pn);
            }

            /// \brief Set pin to ON state.
            ///
            inline static void set() {
                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                regs->BSRR = 1 << _pn;
            }

            /// \brief Set pin to OFF state.
            ///
            inline static void clear() {
                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                regs->BSRR = 1 << (_pn + 16);
            }

            /// \brief Toggle pin state.
            ///
            inline static void toggle() {
                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                regs->ODR ^= 1 << _pn;
            }

            /// \brief Read pin state
            /// \return Pin state.
            ///
            inline static bool read() {
                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                return regs->IDR & (1 << _pn);
            }

            /// \brief Write pin state.
            /// \param b: State to write.
            ///
            inline static void write(bool s) {
                GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);
                regs->BSRR = 1 << (_pn + (s ? 0 : 16));
            }
    };


