Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
    #ifdef GPIOA_BASE
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin0> GPIO_A0;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin1> GPIO_A1;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin2> GPIO_A2;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin3> GPIO_A3;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin4> GPIO_A4;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin5> GPIO_A5;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin6> GPIO_A6;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin7> GPIO_A7;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin8> GPIO_A8;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin9> GPIO_A9;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin10> GPIO_A10;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin11> GPIO_A11;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin12> GPIO_A12;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin13> GPIO_A13;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin14> GPIO_A14;
        typedef GPIO_x<GPIOPort::portA, GPIOPin::pin15> GPIO_A15;
    #endif

    #ifdef GPIOB_BASE
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin0> GPIO_B0;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin1> GPIO_B1;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin2> GPIO_B2;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin3> GPIO_B3;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin4> GPIO_B4;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin5> GPIO_B5;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin6> GPIO_B6;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin7> GPIO_B7;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin8> GPIO_B8;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin9> GPIO_B9;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin10> GPIO_B10;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin11> GPIO_B11;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin12> GPIO_B12;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin13> GPIO_B13;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin14> GPIO_B14;
        typedef GPIO_x<GPIOPort::portB, GPIOPin::pin15> GPIO_B15;
    #endif

    #ifdef GPIOC_BASE
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin0> GPIO_C0;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin1> GPIO_C1;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin2> GPIO_C2;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin3> GPIO_C3;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin4> GPIO_C4;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin5> GPIO_C5;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin6> GPIO_C6;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin7> GPIO_C7;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin8> GPIO_C8;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin9> GPIO_C9;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin10> GPIO_C10;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin11> GPIO_C11;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin12> GPIO_C12;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin13> GPIO_C13;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin14> GPIO_C14;
        typedef GPIO_x<GPIOPort::portC, GPIOPin::pin15> GPIO_C15;
    #endif

    #ifdef GPIOD_BASE
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin0> GPIO_D0;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin1> GPIO_D1;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin2> GPIO_D2;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin3> GPIO_D3;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin4> GPIO_D4;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin5> GPIO_D5;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin6> GPIO_D6;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin7> GPIO_D7;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin8> GPIO_D8;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin9> GPIO_D9;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin10> GPIO_D10;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin11> GPIO_D11;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin12> GPIO_D12;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin13> GPIO_D13;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin14> GPIO_D14;
        typedef GPIO_x<GPIOPort::portD, GPIOPin::pin15> GPIO_D15;
    #endif

    #ifdef GPIOE_BASE
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin0> GPIO_E0;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin1> GPIO_E1;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin2> GPIO_E2;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin3> GPIO_E3;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin4> GPIO_E4;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin5> GPIO_E5;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin6> GPIO_E6;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin7> GPIO_E7;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin8> GPIO_E8;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin9> GPIO_E9;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin10> GPIO_E10;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin11> GPIO_E11;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin12> GPIO_E12;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin13> GPIO_E13;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin14> GPIO_E14;
        typedef GPIO_x<GPIOPort::portE, GPIOPin::pin15> GPIO_E15;
    #endif

    #ifdef GPIOF_BASE
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin0> GPIO_F0;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin1> GPIO_F1;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin2> GPIO_F2;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin3> GPIO_F3;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin4> GPIO_F4;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin5> GPIO_F5;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin6> GPIO_F6;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin7> GPIO_F7;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin8> GPIO_F8;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin9> GPIO_F9;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin10> GPIO_F10;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin11> GPIO_F11;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin12> GPIO_F12;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin13> GPIO_F13;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin14> GPIO_F14;
        typedef GPIO_x<GPIOPort::portF, GPIOPin::pin15> GPIO_F15;
    #endif

    #ifdef GPIOG_BASE
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin0> GPIO_G0;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin1> GPIO_G1;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin2> GPIO_G2;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin3> GPIO_G3;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin4> GPIO_G4;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin5> GPIO_G5;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin6> GPIO_G6;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin7> GPIO_G7;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin8> GPIO_G8;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin9> GPIO_G9;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin10> GPIO_G10;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin11> GPIO_G11;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin12> GPIO_G12;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin13> GPIO_G13;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin14> GPIO_G14;
        typedef GPIO_x<GPIOPort::portG, GPIOPin::pin15> GPIO_G15;
    #endif

