Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
    #ifdef GPIOH_BASE
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin0> GPIO_H0;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin1> GPIO_H1;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin2> GPIO_H2;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin3> GPIO_H3;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin4> GPIO_H4;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin5> GPIO_H5;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin6> GPIO_H6;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin7> GPIO_H7;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin8> GPIO_H8;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin9> GPIO_H9;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin10> GPIO_H10;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin11> GPIO_H11;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin12> GPIO_H12;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin13> GPIO_H13;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin14> GPIO_H14;
        typedef GPIO_x<GPIOPort::portH, GPIOPin::pin15> GPIO_H15;
    #endif

    #ifdef GPIOI_BASE
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin0> GPIO_I0;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin1> GPIO_I1;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin2> GPIO_I2;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin3> GPIO_I3;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin4> GPIO_I4;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin5> GPIO_I5;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin6> GPIO_I6;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin7> GPIO_I7;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin8> GPIO_I8;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin9> GPIO_I9;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin10> GPIO_I10;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin11> GPIO_I11;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin12> GPIO_I12;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin13> GPIO_I13;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin14> GPIO_I14;
        typedef GPIO_x<GPIOPort::portI, GPIOPin::pin15> GPIO_I15;
    #endif

    #ifdef GPIOJ_BASE
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin0> GPIO_J0;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin1> GPIO_J1;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin2> GPIO_J2;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin3> GPIO_J3;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin4> GPIO_J4;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin5> GPIO_J5;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin6> GPIO_J6;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin7> GPIO_J7;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin8> GPIO_J8;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin9> GPIO_J9;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin10> GPIO_J10;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin11> GPIO_J11;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin12> GPIO_J12;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin13> GPIO_J13;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin14> GPIO_J14;
        typedef GPIO_x<GPIOPort::portJ, GPIOPin::pin15> GPIO_J15;
    #endif

    #ifdef GPIOK_BASE
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin0> GPIO_K0;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin1> GPIO_K1;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin2> GPIO_K2;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin3> GPIO_K3;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin4> GPIO_K4;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin5> GPIO_K5;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin6> GPIO_K6;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin7> GPIO_K7;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin8> GPIO_K8;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin9> GPIO_K9;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin10> GPIO_K10;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin11> GPIO_K11;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin12> GPIO_K12;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin13> GPIO_K13;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin14> GPIO_K14;
        typedef GPIO_x<GPIOPort::portK, GPIOPin::pin15> GPIO_K15;
    #endif


    #ifdef GPIOA_BASE
        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin0> {
            enum class GPIOAlt {
                eth_MII_CRS = 11,
                #ifdef EOS_STM32F7
                    sai2_SD_B = 10,
                #endif
                tim2_CH1 = 1,
                tim2_ETR = 1,
                tim5_CH1 = 2,
                tim8_ETR = 3,
                usart2_CTS = 7,
                uart4_TX = 8,
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 0;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin1> {
            enum class GPIOAlt {
                eth_MII_RX_CLK = 11,
                #ifdef EOS_STM32F7
                    sai2_MCK_B = 10,
                #endif
                tim2_CH2 = 2,
                tim5_CH2 = 3,
                usart2_RTS = 7,
                uart4_RX = 8
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 1;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin3> {
            enum class GPIOAlt {
            	ltdc_B5 = 14
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 3;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin4> {
            enum class GPIOAlt {
                dcmi_HSYNC = 13,
                ltdc_VSYNC = 14,
                usart2_CK = 7,
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 4;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin5> {
            enum class GPIOAlt {
                i2s1_CL = 5,
                spi1_SCK = 5
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 5;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin6> {
            enum class GPIOAlt {
                dcmi_PIXCK = 13,
   				ltdc_G2 = 14,
                spi1_MISO = 5
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 6;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin7> {
            enum class GPIOAlt {
                i2s1_SD = 5,
                spi1_MOSI = 5
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 7;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin11> {
            enum class GPIOAlt {
            	ltdc_R4 = 14
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 11;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin12> {
            enum class GPIOAlt {
            	ltdc_R5 = 14
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 12;
        };
    #endif

    #ifdef GPIOB_BASE
        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin0> {
            enum class GPIOAlt {
                ltdc_R3 = 9
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 0;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin1> {
            enum class GPIOAlt {
                ltdc_R6 = 9
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 1;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin8> {
            enum class GPIOAlt {
                i2c1_SCL = 4,
                ltdc_B6 = 14
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 8;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin9> {
            enum class GPIOAlt {
                i2c1_SDA = 4,
                ltdc_B7 = 14,
                spi2_NSS = 5
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 9;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin10> {
            enum class GPIOAlt {
                i2c2_SCL = 4,
                ltdc_G4 = 14,
                spi2_SCK = 5
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 10;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin11> {
            enum class GPIOAlt {
            	ltdc_G5 = 14
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 11;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin14> {
            enum class GPIOAlt {
                spi2_MISO = 5
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 14;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin15> {
            enum class GPIOAlt {
                spi2_MOSI = 5
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 15;
        };
    #endif

    #ifdef GPIOC_BASE
        template <>
        struct GPIOInfo<GPIOPort::portC, GPIOPin::pin2> {
            enum class GPIOAlt {
            };
            constexpr static const uint32_t addr = GPIOC_BASE;
            constexpr static const uint32_t pn = 2;
        };

        template <>
        struct GPIOInfo<GPIOPort::portC, GPIOPin::pin6> {
            enum class GPIOAlt {
                ltdc_HSYNC = 14,
                uart6_TX = 8
            };
            constexpr static const uint32_t addr = GPIOC_BASE;
            constexpr static const uint32_t pn = 6;
        };

        template <>
        struct GPIOInfo<GPIOPort::portC, GPIOPin::pin7> {
            enum class GPIOAlt {
                ltdc_G6 = 14,
                uart6_RX = 8
            };
            constexpr static const uint32_t addr = GPIOC_BASE;
            constexpr static const uint32_t pn = 7;
        };

        template <>
        struct GPIOInfo<GPIOPort::portC, GPIOPin::pin10> {
            enum class GPIOAlt {
                ltdc_R2 = 14,
            };
            constexpr static const uint32_t addr = GPIOC_BASE;
            constexpr static const uint32_t pn = 10;
        };
    #endif

    #ifdef GPIOD_BASE
        template <>
        struct GPIOInfo<GPIOPort::portD, GPIOPin::pin3> {
            enum class GPIOAlt {
                dcmi_D5 = 13,
                ltdc_G7 = 14
            };
            constexpr static const uint32_t addr = GPIOD_BASE;
            constexpr static const uint32_t pn = 3;
        };

        template <>
        struct GPIOInfo<GPIOPort::portD, GPIOPin::pin6> {
            enum class GPIOAlt {
            	ltdc_B2 = 14,
                spi3_SCK = 5,
                i2s3_SD = 5
            };
            constexpr static const uint32_t addr = GPIOD_BASE;
            constexpr static const uint32_t pn = 6;
        };

        template <>
        struct GPIOInfo<GPIOPort::portD, GPIOPin::pin7> {
            enum class GPIOAlt {
                fmc_NE1 = 12,
                usart2_CK = 7,
                spdifrx_IN0 = 8
            };
            constexpr static const uint32_t addr = GPIOD_BASE;
            constexpr static const uint32_t pn = 7;
        };

        template <>
        struct GPIOInfo<GPIOPort::portD, GPIOPin::pin13> {
            enum class GPIOAlt {
            };
            constexpr static const uint32_t addr = GPIOD_BASE;
            constexpr static const uint32_t pn = 13;
        };
    #endif

    #ifdef GPIOE_BASE
        template <>
        struct GPIOInfo<GPIOPort::portE, GPIOPin::pin4> {
            enum class GPIOAlt {
                ltdc_B0 = 14
            };
            constexpr static const uint32_t addr = GPIOE_BASE;
            constexpr static const uint32_t pn = 4;
        };

        template <>
        struct GPIOInfo<GPIOPort::portE, GPIOPin::pin5> {
            enum class GPIOAlt {
                dcmi_D6 = 13
            };
            constexpr static const uint32_t addr = GPIOE_BASE;
            constexpr static const uint32_t pn = 5;
        };

        template <>
        struct GPIOInfo<GPIOPort::portE, GPIOPin::pin6> {
            enum class GPIOAlt {
                dcmi_D7 = 13
            };
            constexpr static const uint32_t addr = GPIOE_BASE;
            constexpr static const uint32_t pn = 6;
        };
    #endif

