Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
    #ifdef GPIOF_BASE
        template <>
        struct GPIOInfo<GPIOPort::portF, GPIOPin::pin7> {
            enum class GPIOAlt {
                spi5_SCK = 5,
                uart7_TX = 8
            };
            constexpr static const uint32_t addr = GPIOF_BASE;
            constexpr static const uint32_t pn = 7;
        };

        template <>
        struct GPIOInfo<GPIOPort::portF, GPIOPin::pin9> {
            enum class GPIOAlt {
                spi5_MOSI = 5,
                #ifdef EOS_STM32F7
                    uart7_TX = 8
                #endif
            };
            constexpr static const uint32_t addr = GPIOF_BASE;
            constexpr static const uint32_t pn = 9;
        };

        template <>
        struct GPIOInfo<GPIOPort::portF, GPIOPin::pin10> {
            enum class GPIOAlt {
            	ltdc_DE = 14
            };
            constexpr static const uint32_t addr = GPIOF_BASE;
            constexpr static const uint32_t pn = 10;
        };
    #endif

    #ifdef GPIOG_BASE
        template <>
        struct GPIOInfo<GPIOPort::portG, GPIOPin::pin6> {
            enum class GPIOAlt {
            	ltdc_R7 = 14
            };
            constexpr static const uint32_t addr = GPIOG_BASE;
            constexpr static const uint32_t pn = 6;
        };

        template <>
        struct GPIOInfo<GPIOPort::portG, GPIOPin::pin7> {
            enum class GPIOAlt {
            	ltdc_DOTCLK = 14
            };
            constexpr static const uint32_t addr = GPIOG_BASE;
            constexpr static const uint32_t pn = 7;
        };

        template <>
        struct GPIOInfo<GPIOPort::portG, GPIOPin::pin9> {
            enum class GPIOAlt {
                dcmi_VSYNC = 13,
                uart6_RX = 8
            };
            constexpr static const uint32_t addr = GPIOG_BASE;
            constexpr static const uint32_t pn = 9;
        };

        template <>
        struct GPIOInfo<GPIOPort::portG, GPIOPin::pin10> {
            enum class GPIOAlt {
            	ltdc_G3 = 9
            };
            constexpr static const uint32_t addr = GPIOG_BASE;
            constexpr static const uint32_t pn = 10;
        };

        template <>
        struct GPIOInfo<GPIOPort::portG, GPIOPin::pin11> {
            enum class GPIOAlt {
            	ltdc_B3 = 14
            };
            constexpr static const uint32_t addr = GPIOG_BASE;
            constexpr static const uint32_t pn = 11;
        };

        template <>
        struct GPIOInfo<GPIOPort::portG, GPIOPin::pin12> {
            enum class GPIOAlt {
                ltdc_B1 = 14,
                ltdc_B4 = 9,
                spi6_MISO = 5,
                usart6_RTS = 8
            };
            constexpr static const uint32_t addr = GPIOG_BASE;
            constexpr static const uint32_t pn = 12;
        };

        template <>
        struct GPIOInfo<GPIOPort::portG, GPIOPin::pin13> {
            enum class GPIOAlt {
            };
            constexpr static const uint32_t addr = GPIOG_BASE;
            constexpr static const uint32_t pn = 13;
        };

        template <>
        struct GPIOInfo<GPIOPort::portG, GPIOPin::pin14> {
            enum class GPIOAlt {
            };
            constexpr static const uint32_t addr = GPIOG_BASE;
            constexpr static const uint32_t pn = 14;
        };
    #endif

    #ifdef GPIOH_BASE
        template <>
        struct GPIOInfo<GPIOPort::portH, GPIOPin::pin7> {
            enum class GPIOAlt {
                i2c3_SCL = 4
            };
            constexpr static const uint32_t addr = GPIOH_BASE;
            constexpr static const uint32_t pn = 7;
        };

        template <>
        struct GPIOInfo<GPIOPort::portH, GPIOPin::pin8> {
            enum class GPIOAlt {
                i2c3_SDA = 4,
                ltdc_R2 = 14
            };
            constexpr static const uint32_t addr = GPIOH_BASE;
            constexpr static const uint32_t pn = 8;
        };

        template <>
        struct GPIOInfo<GPIOPort::portH, GPIOPin::pin9> {
            enum class GPIOAlt {
                dcmi_D0 = 13
            };
            constexpr static const uint32_t addr = GPIOH_BASE;
            constexpr static const uint32_t pn = 9;
        };

        template <>
        struct GPIOInfo<GPIOPort::portH, GPIOPin::pin10> {
            enum class GPIOAlt {
                dcmi_D1 = 13
            };
            constexpr static const uint32_t addr = GPIOH_BASE;
            constexpr static const uint32_t pn = 10;
        };

        template <>
        struct GPIOInfo<GPIOPort::portH, GPIOPin::pin11> {
            enum class GPIOAlt {
                dcmi_D2 = 13
            };
            constexpr static const uint32_t addr = GPIOH_BASE;
            constexpr static const uint32_t pn = 11;
        };

        template <>
        struct GPIOInfo<GPIOPort::portH, GPIOPin::pin12> {
            enum class GPIOAlt {
                dcmi_D3 = 13
            };
            constexpr static const uint32_t addr = GPIOH_BASE;
            constexpr static const uint32_t pn = 12;
        };

        template <>
        struct GPIOInfo<GPIOPort::portH, GPIOPin::pin14> {
            enum class GPIOAlt {
                dcmi_D4 = 13
            };
            constexpr static const uint32_t addr = GPIOH_BASE;
            constexpr static const uint32_t pn = 14;
        };
    #endif

    #ifdef GPIOI_BASE
        template <>
        struct GPIOInfo<GPIOPort::portI, GPIOPin::pin1> {
            enum class GPIOAlt {
                spi2_SCK = 5
            };
            constexpr static const uint32_t addr = GPIOI_BASE;
            constexpr static const uint32_t pn = 1;
        };

        template <>
        struct GPIOInfo<GPIOPort::portI, GPIOPin::pin9> {
            enum class GPIOAlt {
                ltdc_VSYNC = 14
            };
            constexpr static const uint32_t addr = GPIOI_BASE;
            constexpr static const uint32_t pn = 9;
        };

        template <>
        struct GPIOInfo<GPIOPort::portI, GPIOPin::pin10> {
            enum class GPIOAlt {
                ltdc_HSYNC = 14
            };
            constexpr static const uint32_t addr = GPIOI_BASE;
            constexpr static const uint32_t pn = 10;
        };

        template <>
        struct GPIOInfo<GPIOPort::portI, GPIOPin::pin12> {
            enum class GPIOAlt {
            	ltdc_LCDE = 14
            };
            constexpr static const uint32_t addr = GPIOI_BASE;
            constexpr static const uint32_t pn = 12;
        };

        template <>
        struct GPIOInfo<GPIOPort::portI, GPIOPin::pin13> {
            enum class GPIOAlt {
            };
            constexpr static const uint32_t addr = GPIOI_BASE;
            constexpr static const uint32_t pn = 13;
        };

        template <>
        struct GPIOInfo<GPIOPort::portI, GPIOPin::pin14> {
            enum class GPIOAlt {
                ltdc_DOTCLK = 14
            };
            constexpr static const uint32_t addr = GPIOI_BASE;
            constexpr static const uint32_t pn = 14;
        };

        template <>
        struct GPIOInfo<GPIOPort::portI, GPIOPin::pin15> {
            enum class GPIOAlt {
                ltdc_R0 = 14
            };
            constexpr static const uint32_t addr = GPIOI_BASE;
            constexpr static const uint32_t pn = 15;
        };
    #endif

    #ifdef GPIOJ_BASE
        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin0> {
            enum class GPIOAlt {
                ltdc_R1 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 0;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin1> {
            enum class GPIOAlt {
                ltdc_R2 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 1;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin2> {
            enum class GPIOAlt {
                ltdc_R3 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 2;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin3> {
            enum class GPIOAlt {
                ltdc_R4 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 3;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin4> {
            enum class GPIOAlt {
                ltdc_R5 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 4;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin5> {
            enum class GPIOAlt {
                ltdc_R6 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 5;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin6> {
            enum class GPIOAlt {
                ltdc_R7 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 6;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin7> {
            enum class GPIOAlt {
                ltdc_G0 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 7;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin8> {
            enum class GPIOAlt {
                ltdc_G1 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 8;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin9> {
            enum class GPIOAlt {
                ltdc_G2 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 9;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin10> {
            enum class GPIOAlt {
                ltdc_G3 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 10;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin11> {
            enum class GPIOAlt {
                ltdc_G4 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 11;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin13> {
            enum class GPIOAlt {
                ltdc_B1 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 13;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin14> {
            enum class GPIOAlt {
                ltdc_B2 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 14;
        };

        template <>
        struct GPIOInfo<GPIOPort::portJ, GPIOPin::pin15> {
            enum class GPIOAlt {
                ltdc_B3 = 14
            };
            constexpr static const uint32_t addr = GPIOJ_BASE;
            constexpr static const uint32_t pn = 15;
        };
    #endif

    #ifdef GPIOK_BASE
        template <>
        struct GPIOInfo<GPIOPort::portK, GPIOPin::pin0> {
            enum class GPIOAlt {
                ltdc_G5 = 14
            };
            constexpr static const uint32_t addr = GPIOK_BASE;
            constexpr static const uint32_t pn = 0;
        };

        template <>
        struct GPIOInfo<GPIOPort::portK, GPIOPin::pin1> {
            enum class GPIOAlt {
                ltdc_G6 = 14
            };
            constexpr static const uint32_t addr = GPIOK_BASE;
            constexpr static const uint32_t pn = 1;
        };

        template <>
        struct GPIOInfo<GPIOPort::portK, GPIOPin::pin2> {
            enum class GPIOAlt {
                ltdc_G7 = 14
            };
            constexpr static const uint32_t addr = GPIOK_BASE;
            constexpr static const uint32_t pn = 2;
        };

        template <>
        struct GPIOInfo<GPIOPort::portK, GPIOPin::pin3> {
            enum class GPIOAlt {
            };
            constexpr static const uint32_t addr = GPIOK_BASE;
            constexpr static const uint32_t pn = 3;
        };

        template <>
        struct GPIOInfo<GPIOPort::portK, GPIOPin::pin4> {
            enum class GPIOAlt {
                ltdc_B5 = 14
            };
            constexpr static const uint32_t addr = GPIOK_BASE;
            constexpr static const uint32_t pn = 4;
        };

        template <>
        struct GPIOInfo<GPIOPort::portK, GPIOPin::pin5> {
            enum class GPIOAlt {
                ltdc_B6 = 14
            };
            constexpr static const uint32_t addr = GPIOK_BASE;
            constexpr static const uint32_t pn = 5;
        };

        template <>
        struct GPIOInfo<GPIOPort::portK, GPIOPin::pin6> {
            enum class GPIOAlt {
                ltdc_B7 = 14
            };
            constexpr static const uint32_t addr = GPIOK_BASE;
            constexpr static const uint32_t pn = 6;
        };

        template <>
        struct GPIOInfo<GPIOPort::portK, GPIOPin::pin7> {
            enum class GPIOAlt {
                ltdc_DE = 14
            };
            constexpr static const uint32_t addr = GPIOK_BASE;
            constexpr static const uint32_t pn = 7;
        };
    #endif

}


#endif // __STM32_htlGPIO__

/// @}
/// @}
/// @}

